ادخل Ember الى 'ember';
ادخل EN الى './champions';

const النتيجة = {
  "السكربت": {
    "الازرار": {
      "تنصيب": "تنصيب",
      "خيارات": "خيارات"
    },
    "بحث_بواسطة": {
      "اسمبليس": "التشامبيون",
      "المكتبات": "المكتبات",
     "المساعدات": "المساعدات"
    },
    "صيغة_البحث": "بحث عن اسمبليس",
    "فرز_بي حسب": {
      "التحديث_الاخير": "التحديث_الاخير",
      "الاسم": "الاسم",
      "التقدير": "التقدير"
    },
    "كتب_بواسطة": هذا الاسبملي كتب بواسطة {المؤلف} واخر تحديث كان {حتى_الان}"
  "التصميم": {
    "خروج": "خروج",
    "التنقل": {
      "سجل_التبطيق": "سجل_التطبيق",
      "اسمبليس": "اسمبليس",
      "سجل_التغيير": "سجل_التغيير,
      "الاخبار": "الاخبار",
      "الملف": "الملف",
      "الأعدادت": "الأعدادت"
    },
"مرحبا_بعودتك": "مرحبا بعودتك, {اسم المستخدم}!"
},
  "الملفات": {
    "حدد": {
      "root": {
        "create": "انتج طقم جديد",
        "default": "الملف الافتراضي {index}",
        "title": "مجموعاتي"
      },
      "entry": {
        "author": "مؤلف الاسمبلي",
        "name": "اسم الاسمبلي",
        "version": "نسخة الاسمبلي"
      }
    }
  }
};

Ember.merge(result, EN);

export default result;
